constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    INLET
    {
        type            patch;
        nFaces          225;
        startFace       131893;
    }
    OUTLET
    {
        type            patch;
        nFaces          225;
        startFace       132118;
    }
    SYMMETRY
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          604;
        startFace       132343;
    }
    SQUARE_UP
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          116;
        startFace       132947;
    }
    SQUARE_DOWN
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          116;
        startFace       133063;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          132536;
        startFace       133179;
    }
)

// ************************************************************************* //
