0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
66268
(
(0.999998 -4.39336e-05 0)
(1.00001 -0.000159854 0)
(0.999996 -0.000258278 0)
(1.00001 -0.000355327 0)
(0.999996 -0.000458511 0)
(1.00001 -0.000550358 0)
(0.999995 -0.000653793 0)
(1.00001 -0.000742555 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<vector> 
225
(
(1.05885 -0.000724779 0)
(1.0591 -0.00230717 0)
(1.05951 -0.00374301 0)
(1.06014 -0.00524675 0)
(1.06089 -0.00670605 0)
(1.06183 -0.00820517 0)
(1.06285 -0.00972033 0)
(1.06404 -0.0112873 0)
...
)
;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
