0/U_d10
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d10;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
66268
(
(-4.61559e-10 9.3293e-10 0)
(-1.23943e-09 -1.3093e-09 0)
(-2.67401e-10 -1.671e-09 0)
(-1.21524e-09 -1.31806e-09 0)
(-2.28943e-12 -2.79914e-09 0)
(-1.28402e-09 -2.79714e-09 0)
(5.24563e-10 -4.87392e-09 0)
(-5.36647e-10 -3.24411e-09 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
