0/U_d2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
66268
(
(5.1495e-07 -3.76407e-07 0)
(6.02091e-07 -2.73293e-07 0)
(2.16677e-07 7.12081e-07 0)
(1.86978e-07 -1.34791e-06 0)
(2.0517e-07 2.50978e-07 0)
(1.93932e-07 -7.95145e-07 0)
(6.00981e-08 1.66036e-06 0)
(-4.46566e-07 -1.43714e-06 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
