0/U_d3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
66268
(
(-5.83218e-09 -3.37313e-08 0)
(2.26236e-08 -2.74035e-08 0)
(-7.02013e-11 -8.95792e-09 0)
(9.0692e-09 -5.03222e-08 0)
(-3.67825e-08 -5.24107e-08 0)
(1.46518e-08 -6.12565e-08 0)
(-9.00334e-08 -1.80301e-08 0)
(7.01275e-09 -1.02667e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
