0/U_d5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
66268
(
(-3.1612e-09 -1.89256e-08 0)
(8.3287e-09 -5.39514e-08 0)
(-7.18924e-09 -9.55583e-08 0)
(8.24252e-09 -1.20074e-07 0)
(-6.92623e-09 -1.62122e-07 0)
(7.87566e-09 -1.78402e-07 0)
(-6.87984e-09 -2.19212e-07 0)
(7.44326e-09 -2.29354e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
